Revit 2026 API

# SpecTypeIdReference Class

---

This class contains constants identifying reference specs.

SystemObject Autodesk.Revit.DBSpecTypeIdReference

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class Reference
```
```vb
Public NotInheritable Class Reference
```
```cpp
public ref class Reference abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type Reference = class end
```

The SpecTypeIdReference type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FillPattern | Fill Pattern, in discipline Common. |
|  | Image | Image, in discipline Common. |
|  | LoadClassification | Load Classification, in discipline Electrical. |
|  | Material | Material, in discipline Common. |

#### Reference

Autodesk.Revit.DB Namespace